<?php

namespace Database\Seeders;


use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class SchoolSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // รายชื่อโรงเรียน 20 แห่ง
        $schools = [
            'โรงเรียนเตรียมอุดมศึกษา',
            'โรงเรียนมหิดลวิทยานุสรณ์',
            'โรงเรียนสวนกุหลาบวิทยาลัย',
            'โรงเรียนสามเสนวิทยาลัย',
            'โรงเรียนบดินทรเดชา (สิงห์ สิงหเสนี)',
            'โรงเรียนเทพศิรินทร์',
            'โรงเรียนสตรีวิทยา',
            'โรงเรียนสาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
            'โรงเรียนสาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ปทุมวัน',
            'โรงเรียนกรุงเทพคริสเตียนวิทยาลัย',
            'โรงเรียนอัสสัมชัญ',
            'โรงเรียนเซนต์คาเบรียล',
            'โรงเรียนหาดใหญ่วิทยาลัย',
            'โรงเรียนบุญวาทย์วิทยาลัย',
            'โรงเรียนมงฟอร์ตวิทยาลัย',
            'โรงเรียนปรินส์รอยแยลส์วิทยาลัย',
            'โรงเรียนอุดรพิทยานุกูล',
            'โรงเรียนเบ็ญจะมะมหาราช',
            'โรงเรียนเบญจมราชูทิศ',
            'โรงเรียนราชินี',
        ];

        // วนลูปเพื่อสร้างข้อมูลแต่ละโรงเรียน
        foreach ($schools as $schoolName) {

            $slug = 'แนวข้อสอบเตรียมสอบ' . str_replace(' ', '-', $schoolName);

            DB::table('schools')->insert([
                'name' => $schoolName,
                // สร้าง slug อัตโนมัติ: 'หนังสือสอบเข้า' + 'ชื่อโรงเรียนแบบไม่มีเว้นวรรค'
                'slug' => $slug,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}
